/*******************************************************************************************************************
* 檔案名稱：hw01_7seg.v
* 模組名稱：七段顯示解碼器
* 功    能：將4bits二進制數字轉為一七段顯示器，並以十六進制顯示。
* 輸入參數：din		4bits二進制數字           
* 輸出參數：dout	7bits七段顯示器輸入腳
* 說    明：七段顯示器為共陽極，故訊號0為亮。
													JH design
*******************************************************************************************************************/


module hw01_7seg(din,dout); 
input 	[3:0]	din;
output	[6:0]	dout;
reg		[6:0]	dout;
always@(din)
begin
	case(din)
	 	4'b0000:dout<=7'b1000000;
	 	4'b0001:dout<=7'b1111001;
	 	4'b0010:dout<=7'b0100100;
	 	4'b0011:dout<=7'b0110000;
	 	4'b0100:dout<=7'b0011001;
	 	4'b0101:dout<=7'b0010010;
	 	4'b0110:dout<=7'b0000010;
	 	4'b0111:dout<=7'b1111000;
		4'b1000:dout<=7'b0000000;
	 	/*請在此撰寫程式碼，使程式碼完整*/
	endcase
end
endmodule
